# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [0]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [0]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
names = pd.read_csv(url)

### Step 4. See the first 10 entries

In [3]:
names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
names.drop(columns=["Unnamed: 0","Id"], inplace=True)
names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Are there more male or female names in the dataset?

In [5]:
# names["Gender"].value_counts()
# names.groupby("Gender").agg({"Gender": "count"})
names.groupby("Gender").count().Count

Gender
F    558846
M    457549
Name: Count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
# names.drop("Year", axis=1, inplace=True)
names2 = names.groupby("Name").sum().sort_values(by="Count", ascending=False)
names2.head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

### Step 8. How many different names exist in the dataset?

In [41]:
names["Name"].nunique()

17632

### Step 9. What is the name with most occurrences?

In [17]:
# names2[names2.Count == max(names2.Count)]
# names2[names2.Count == names2.Count.max()]
names2.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [19]:
len(names2[names2.Count == names2.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [23]:
list(names2[names2.Count == names2.Count.median()].index.values)

['Zuleima',
 'Vita',
 'Aziah',
 'Kaedence',
 'Antonina',
 'Nabeel',
 'Leylanie',
 'Mariann',
 'Iven',
 'Gurshaan',
 'Reghan',
 'Emmaly',
 'Kaelee',
 'Emmanuela',
 'Rubin',
 'Deserae',
 'Envy',
 'Baily',
 'Kaio',
 'Maisha',
 'Dahlila',
 'Alara',
 'Sanjuanita',
 'Jaiyana',
 'Fay',
 'Ridwan',
 'Devean',
 'Kailana',
 'Jaice',
 'Caleah',
 'Trinton',
 'Nishant',
 'Riot',
 'Malillany',
 'Jamiracle',
 'Esli',
 'Sameera',
 'Skylie',
 'Aishani',
 'Carlota',
 'Sriram',
 'Aveline',
 'Jeovany',
 'Elizah',
 'Jelissa',
 'Ameir',
 'Deante',
 'Nassir',
 'Cristine',
 'Darvin',
 'Nalleli',
 'Shalyn',
 'Kynsley',
 'Rebecka',
 'Alysse',
 'Maurilio',
 'Kyndle',
 'Marquell',
 'Anely',
 'Ryatt',
 'Mehdi',
 'Mckynzie',
 'Yoni',
 'Hareem',
 'Jkwon',
 'Nazier']

### Step 12. What is the standard deviation of names?

In [25]:
names2.Count.std()

11006.0694678915

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [26]:
names2.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000